; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	infrared1 - mode
	infrared3 - mode
	thermograph2 - mode
	image0 - mode
	Star1 - direction
	GroundStation2 - direction
	Star0 - direction
	Star3 - direction
	Star4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph2)
	(supports instrument2 infrared3)
	(supports instrument2 image0)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 153)
	(supports instrument3 infrared3)
	(supports instrument3 image0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star0)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 110)
	(supports instrument4 thermograph2)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 168)
	(supports instrument5 image0)
	(calibration_target instrument5 Star0)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet5)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 197)
	(= (data Star3 infrared1) 23)
	(= (data Star4 infrared1) 271)
	(= (data Planet5 infrared1) 143)
	(= (data Phenomenon6 infrared1) 5)
	(= (data Planet7 infrared1) 210)
	(= (data Phenomenon8 infrared1) 240)
	(= (data Planet9 infrared1) 232)
	(= (data Star3 infrared3) 290)
	(= (data Star4 infrared3) 97)
	(= (data Planet5 infrared3) 161)
	(= (data Phenomenon6 infrared3) 287)
	(= (data Planet7 infrared3) 128)
	(= (data Phenomenon8 infrared3) 294)
	(= (data Planet9 infrared3) 124)
	(= (data Star3 thermograph2) 247)
	(= (data Star4 thermograph2) 189)
	(= (data Planet5 thermograph2) 35)
	(= (data Phenomenon6 thermograph2) 29)
	(= (data Planet7 thermograph2) 269)
	(= (data Phenomenon8 thermograph2) 49)
	(= (data Planet9 thermograph2) 107)
	(= (data Star3 image0) 86)
	(= (data Star4 image0) 15)
	(= (data Planet5 image0) 170)
	(= (data Phenomenon6 image0) 123)
	(= (data Planet7 image0) 7)
	(= (data Phenomenon8 image0) 24)
	(= (data Planet9 image0) 192)
	(= (slew_time Star1 Star0) 20.09)
	(= (slew_time Star0 Star1) 20.09)
	(= (slew_time GroundStation2 Star0) 39.58)
	(= (slew_time Star0 GroundStation2) 39.58)
	(= (slew_time GroundStation2 Star1) 25.9)
	(= (slew_time Star1 GroundStation2) 25.9)
	(= (slew_time Star3 Star0) 19.52)
	(= (slew_time Star0 Star3) 19.52)
	(= (slew_time Star3 Star1) 10.73)
	(= (slew_time Star1 Star3) 10.73)
	(= (slew_time Star3 GroundStation2) 14.41)
	(= (slew_time GroundStation2 Star3) 14.41)
	(= (slew_time Star4 Star0) 1.812)
	(= (slew_time Star0 Star4) 1.812)
	(= (slew_time Star4 Star1) 49.23)
	(= (slew_time Star1 Star4) 49.23)
	(= (slew_time Star4 GroundStation2) 63.22)
	(= (slew_time GroundStation2 Star4) 63.22)
	(= (slew_time Star4 Star3) 25.83)
	(= (slew_time Star3 Star4) 25.83)
	(= (slew_time Planet5 Star0) 2.512)
	(= (slew_time Star0 Planet5) 2.512)
	(= (slew_time Planet5 Star1) 60.86)
	(= (slew_time Star1 Planet5) 60.86)
	(= (slew_time Planet5 GroundStation2) 20.17)
	(= (slew_time GroundStation2 Planet5) 20.17)
	(= (slew_time Planet5 Star3) 7.756)
	(= (slew_time Star3 Planet5) 7.756)
	(= (slew_time Planet5 Star4) 30.61)
	(= (slew_time Star4 Planet5) 30.61)
	(= (slew_time Phenomenon6 Star0) 18.94)
	(= (slew_time Star0 Phenomenon6) 18.94)
	(= (slew_time Phenomenon6 Star1) 12.7)
	(= (slew_time Star1 Phenomenon6) 12.7)
	(= (slew_time Phenomenon6 GroundStation2) 22.2)
	(= (slew_time GroundStation2 Phenomenon6) 22.2)
	(= (slew_time Phenomenon6 Star3) 47.19)
	(= (slew_time Star3 Phenomenon6) 47.19)
	(= (slew_time Phenomenon6 Star4) 30.54)
	(= (slew_time Star4 Phenomenon6) 30.54)
	(= (slew_time Phenomenon6 Planet5) 55.04)
	(= (slew_time Planet5 Phenomenon6) 55.04)
	(= (slew_time Planet7 Star0) 7.757)
	(= (slew_time Star0 Planet7) 7.757)
	(= (slew_time Planet7 Star1) 55.78)
	(= (slew_time Star1 Planet7) 55.78)
	(= (slew_time Planet7 GroundStation2) 4.035)
	(= (slew_time GroundStation2 Planet7) 4.035)
	(= (slew_time Planet7 Star3) 42.42)
	(= (slew_time Star3 Planet7) 42.42)
	(= (slew_time Planet7 Star4) 26.05)
	(= (slew_time Star4 Planet7) 26.05)
	(= (slew_time Planet7 Planet5) 37.07)
	(= (slew_time Planet5 Planet7) 37.07)
	(= (slew_time Planet7 Phenomenon6) 62.95)
	(= (slew_time Phenomenon6 Planet7) 62.95)
	(= (slew_time Phenomenon8 Star0) 41.35)
	(= (slew_time Star0 Phenomenon8) 41.35)
	(= (slew_time Phenomenon8 Star1) 24.76)
	(= (slew_time Star1 Phenomenon8) 24.76)
	(= (slew_time Phenomenon8 GroundStation2) 20.91)
	(= (slew_time GroundStation2 Phenomenon8) 20.91)
	(= (slew_time Phenomenon8 Star3) 5.682)
	(= (slew_time Star3 Phenomenon8) 5.682)
	(= (slew_time Phenomenon8 Star4) 88.97)
	(= (slew_time Star4 Phenomenon8) 88.97)
	(= (slew_time Phenomenon8 Planet5) 79.2)
	(= (slew_time Planet5 Phenomenon8) 79.2)
	(= (slew_time Phenomenon8 Phenomenon6) 46.72)
	(= (slew_time Phenomenon6 Phenomenon8) 46.72)
	(= (slew_time Phenomenon8 Planet7) 43.18)
	(= (slew_time Planet7 Phenomenon8) 43.18)
	(= (slew_time Planet9 Star0) 21.54)
	(= (slew_time Star0 Planet9) 21.54)
	(= (slew_time Planet9 Star1) 51.25)
	(= (slew_time Star1 Planet9) 51.25)
	(= (slew_time Planet9 GroundStation2) 51.44)
	(= (slew_time GroundStation2 Planet9) 51.44)
	(= (slew_time Planet9 Star3) 11.94)
	(= (slew_time Star3 Planet9) 11.94)
	(= (slew_time Planet9 Star4) 51.76)
	(= (slew_time Star4 Planet9) 51.76)
	(= (slew_time Planet9 Planet5) 3.339)
	(= (slew_time Planet5 Planet9) 3.339)
	(= (slew_time Planet9 Phenomenon6) 23.17)
	(= (slew_time Phenomenon6 Planet9) 23.17)
	(= (slew_time Planet9 Planet7) 7.412)
	(= (slew_time Planet7 Planet9) 7.412)
	(= (slew_time Planet9 Phenomenon8) 22.46)
	(= (slew_time Phenomenon8 Planet9) 22.46)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Star3 infrared1)
	(have_image Star4 infrared3)
	(have_image Planet5 infrared1)
	(have_image Phenomenon6 image0)
	(have_image Planet7 image0)
	(have_image Phenomenon8 infrared1)
	(have_image Planet9 infrared1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite2 groundstation2 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 groundstation2)
   changed: (fuel satellite2) from 168 to 128.42, (fuel-used) from 0 to 39.58
   goals met: 0 of 7
2. (turn_to satellite2 planet7 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet7)
   changed: (fuel satellite2) from 128.42 to 124.385, (fuel-used) from 39.58 to 43.615
   goals met: 0 of 7
3. (turn_to satellite2 groundstation2 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 groundstation2)
   changed: (fuel satellite2) from 124.385 to 120.35, (fuel-used) from 43.615 to 47.65
   goals met: 0 of 7
4. (turn_to satellite2 planet7 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet7)
   changed: (fuel satellite2) from 120.35 to 116.315, (fuel-used) from 47.65 to 51.685
   goals met: 0 of 7
5. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 7
6. (turn_to satellite2 groundstation2 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 groundstation2)
   changed: (fuel satellite2) from 116.315 to 112.28, (fuel-used) from 51.685 to 55.72
   goals met: 0 of 7
7. (turn_to satellite2 planet7 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet7)
   changed: (fuel satellite2) from 112.28 to 108.245, (fuel-used) from 55.72 to 59.755
   goals met: 0 of 7
8. (turn_to satellite2 groundstation2 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 groundstation2)
   changed: (fuel satellite2) from 108.245 to 104.21, (fuel-used) from 59.755 to 63.79
   goals met: 0 of 7
9. (turn_to satellite2 planet7 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet7)
   changed: (fuel satellite2) from 104.21 to 100.175, (fuel-used) from 63.79 to 67.825
   goals met: 0 of 7
10. (turn_to satellite2 groundstation2 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 groundstation2)
   changed: (fuel satellite2) from 100.175 to 96.14, (fuel-used) from 67.825 to 71.86
   goals met: 0 of 7
11. (turn_to satellite2 planet7 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet7)
   changed: (fuel satellite2) from 96.14 to 92.105, (fuel-used) from 71.86 to 75.895
   goals met: 0 of 7
12. (turn_to satellite2 groundstation2 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 groundstation2)
   changed: (fuel satellite2) from 92.105 to 88.07, (fuel-used) from 75.895 to 79.93
   goals met: 0 of 7
13. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 7
14. (calibrate satellite2 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 0 of 7
15. (turn_to satellite2 planet7 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet7)
   changed: (fuel satellite2) from 88.07 to 84.035, (fuel-used) from 79.93 to 83.965
   goals met: 0 of 7
16. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 0 of 7
17. (turn_to satellite1 star4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star4)
   changed: (fuel satellite1) from 110 to 108.188, (fuel-used) from 83.965 to 85.777
   goals met: 0 of 7
18. (turn_to satellite0 phenomenon6 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 153 to 140.3, (fuel-used) from 85.777 to 98.477
   goals met: 0 of 7
19. (take_image satellite1 star4 instrument3 infrared3)
   added: (have_image star4 infrared3)
   changed: (data_capacity satellite1) from 1000 to 903, (data-stored) from 0 to 97
   goals met: 1 of 7
20. (turn_to satellite1 phenomenon8 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 108.188 to 19.218, (fuel-used) from 98.477 to 187.447
   goals met: 1 of 7
21. (turn_to satellite0 star0 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 140.3 to 121.36, (fuel-used) from 187.447 to 206.387
   goals met: 1 of 7
22. (take_image satellite1 phenomenon8 instrument3 infrared1)
   added: (have_image phenomenon8 infrared1)
   changed: (data_capacity satellite1) from 903 to 663, (data-stored) from 97 to 337
   goals met: 2 of 7
23. (turn_to satellite1 star3 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star3)
   changed: (fuel satellite1) from 19.218 to 13.536, (fuel-used) from 206.387 to 212.069
   goals met: 2 of 7
24. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 2 of 7
25. (calibrate satellite0 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 2 of 7
26. (turn_to satellite0 phenomenon6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 121.36 to 102.42, (fuel-used) from 212.069 to 231.009
   goals met: 2 of 7
27. (take_image satellite1 star3 instrument3 infrared1)
   added: (have_image star3 infrared1)
   changed: (data_capacity satellite1) from 663 to 640, (data-stored) from 337 to 360
   goals met: 3 of 7
28. (turn_to satellite1 planet5 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet5)
   changed: (fuel satellite1) from 13.536 to 5.78, (fuel-used) from 231.009 to 238.765
   goals met: 3 of 7
29. (take_image satellite1 planet5 instrument3 infrared1)
   added: (have_image planet5 infrared1)
   changed: (data_capacity satellite1) from 640 to 497, (data-stored) from 360 to 503
   goals met: 4 of 7
30. (turn_to satellite1 planet9 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet9)
   changed: (fuel satellite1) from 5.78 to 2.441, (fuel-used) from 238.765 to 242.104
   goals met: 4 of 7
31. (take_image satellite1 planet9 instrument3 infrared1)
   added: (have_image planet9 infrared1)
   changed: (data_capacity satellite1) from 497 to 265, (data-stored) from 503 to 735
   goals met: 5 of 7
32. (take_image satellite0 phenomenon6 instrument2 image0)
   added: (have_image phenomenon6 image0)
   changed: (data_capacity satellite0) from 1000 to 877, (data-stored) from 735 to 858
   goals met: 6 of 7
33. (take_image satellite2 planet7 instrument4 image0)
   added: (have_image planet7 image0)
   changed: (data_capacity satellite2) from 1000 to 993, (data-stored) from 858 to 865
   goals met: 7 of 7
